---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlyColor
source: html/9fcd95cb-17e5-7017-0410-75a402b30f34.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodEarlyColor Property

The property labeled "Earlywood color" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodEarlyColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".